experimental_cases/double_sparger/0.orig/nut.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

#include "${FOAM_CASE}/constant/globalVars"

internalField   uniform $nut_inlet_liq;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet_sparger_top
    {
        type            calculated;
        value           $internalField;
    }
    inlet_sparger_bottom
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    defaultFaces
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
