experimental_cases/double_sparger/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

R1 150.0;
R2 300.0;
R3 500.0;
R4 1000.0;

mR1 -150.0;
mR2 -300.0;
mR3 -500.0;
mR4 -1000.0;

L1 10000.0;
L2 8000.0;
L3 1500.0;
L4 1300.0;
L5 1000.0;
L6 800.0;
L7 0.0;

CW1 75.0;
mCW1 -75.0;
C11 106.06601717798213;
mC11 -106.06601717798213;
C21 106.06601717798212;
mC21 -106.06601717798212;

CW2 150.0;
mCW2 -150.0;
C12 212.13203435596427;
mC12 -212.13203435596427;
C22 212.13203435596424;
mC22 -212.13203435596424;

CW3 250.0;
mCW3 -250.0;
C13 353.5533905932738;
mC13 -353.5533905932738;
C23 353.5533905932737;
mC23 -353.5533905932737;

CW4 500.0;
mCW4 -500.0;
C14 707.1067811865476;
mC14 -707.1067811865476;
C24 707.1067811865474;
mC24 -707.1067811865474;

NR1 3;
NR2 6;
NR3 8;
NR4 14;

NS1 6;

NVert1 15;
NVert2 69;
NVert3 3;
NVert4 4;
NVert5 3;
NVert6 8;

vertices
(
     ($mCW1  $mCW1  $L1)// 0
     ( $CW1  $mCW1  $L1)
     ( $CW1   $CW1  $L1)
     ($mCW1   $CW1  $L1)

     ($mCW1  $mCW1  $L2)// 4
     ( $CW1  $mCW1  $L2)
     ( $CW1   $CW1  $L2)
     ($mCW1   $CW1  $L2)

     ($mCW1  $mCW1  $L3)// 8
     ( $CW1  $mCW1  $L3)
     ( $CW1   $CW1  $L3)
     ($mCW1   $CW1  $L3)

     ($mCW1  $mCW1  $L4)// 12
     ( $CW1  $mCW1  $L4)
     ( $CW1   $CW1  $L4)
     ($mCW1   $CW1  $L4)

     ($mCW1  $mCW1  $L5)// 16
     ( $CW1  $mCW1  $L5)
     ( $CW1   $CW1  $L5)
     ($mCW1   $CW1  $L5)

     ($mCW1  $mCW1  $L6)// 20
     ( $CW1  $mCW1  $L6)
     ( $CW1   $CW1  $L6)
     ($mCW1   $CW1  $L6)

     ($mCW1  $mCW1  $L7)// 24
     ( $CW1  $mCW1  $L7)
     ( $CW1   $CW1  $L7)
     ($mCW1   $CW1  $L7)

    ($mC11   $mC21   $L1)// 28
    ( $C11   $mC21   $L1)
    ( $C11   $C21    $L1)
    ($mC11   $C21    $L1)

    ($mC11   $mC21   $L2)// 32
    ( $C11   $mC21   $L2)
    ( $C11   $C21    $L2)
    ($mC11   $C21    $L2)

    ($mC11   $mC21   $L3)// 36
    ( $C11   $mC21   $L3)
    ( $C11   $C21    $L3)
    ($mC11   $C21    $L3)

    ($mC11   $mC21   $L4)// 40
    ( $C11   $mC21   $L4)
    ( $C11   $C21    $L4)
    ($mC11   $C21    $L4)

    ($mC11   $mC21   $L5)// 44
    ( $C11   $mC21   $L5)
    ( $C11   $C21    $L5)
    ($mC11   $C21    $L5)

    ($mC11   $mC21   $L6)// 48
    ( $C11   $mC21   $L6)
    ( $C11   $C21    $L6)
    ($mC11   $C21    $L6)

    ($mC11   $mC21   $L7)// 52
    ( $C11   $mC21   $L7)
    ( $C11   $C21    $L7)
    ($mC11   $C21    $L7)

    ($mC12   $mC22   $L1)// 56
    ( $C12   $mC22   $L1)
    ( $C12   $C22    $L1)
    ($mC12   $C22    $L1)

    ($mC12   $mC22   $L2)// 60
    ( $C12   $mC22   $L2)
    ( $C12   $C22    $L2)
    ($mC12   $C22    $L2)

    ($mC12   $mC22   $L3)// 64
    ( $C12   $mC22   $L3)
    ( $C12   $C22    $L3)
    ($mC12   $C22    $L3)

    ($mC12   $mC22   $L4)// 68
    ( $C12   $mC22   $L4)
    ( $C12   $C22    $L4)
    ($mC12   $C22    $L4)

    ($mC12   $mC22   $L5)// 72
    ( $C12   $mC22   $L5)
    ( $C12   $C22    $L5)
    ($mC12   $C22    $L5)

    ($mC12   $mC22   $L6)// 76
    ( $C12   $mC22   $L6)
    ( $C12   $C22    $L6)
    ($mC12   $C22    $L6)

    ($mC12   $mC22   $L7)// 80
    ( $C12   $mC22   $L7)
    ( $C12   $C22    $L7)
    ($mC12   $C22    $L7)

    ($mC13   $mC23   $L1)// 84
    ( $C13   $mC23   $L1)
    ( $C13   $C23    $L1)
    ($mC13   $C23    $L1)

    ($mC13   $mC23   $L2)// 88
    ( $C13   $mC23   $L2)
    ( $C13   $C23    $L2)
    ($mC13   $C23    $L2)

    ($mC13   $mC23   $L3)// 92
    ( $C13   $mC23   $L3)
    ( $C13   $C23    $L3)
    ($mC13   $C23    $L3)

    ($mC13   $mC23   $L4)// 96
    ( $C13   $mC23   $L4)
    ( $C13   $C23    $L4)
    ($mC13   $C23    $L4)

    ($mC13   $mC23   $L5)// 100
    ( $C13   $mC23   $L5)
    ( $C13   $C23    $L5)
    ($mC13   $C23    $L5)

    ($mC13   $mC23   $L6)// 104
    ( $C13   $mC23   $L6)
    ( $C13   $C23    $L6)
    ($mC13   $C23    $L6)

    ($mC13   $mC23   $L7)// 108
    ( $C13   $mC23   $L7)
    ( $C13   $C23    $L7)
    ($mC13   $C23    $L7)

    ($mC14   $mC24   $L1)// 112
    ( $C14   $mC24   $L1)
    ( $C14   $C24    $L1)
    ($mC14   $C24    $L1)

    ($mC14   $mC24   $L2)// 116
    ( $C14   $mC24   $L2)
    ( $C14   $C24    $L2)
    ($mC14   $C24    $L2)

    ($mC14   $mC24   $L3)// 120
    ( $C14   $mC24   $L3)
    ( $C14   $C24    $L3)
    ($mC14   $C24    $L3)

    ($mC14   $mC24   $L4)// 124
    ( $C14   $mC24   $L4)
    ( $C14   $C24    $L4)
    ($mC14   $C24    $L4)

    ($mC14   $mC24   $L5)// 128
    ( $C14   $mC24   $L5)
    ( $C14   $C24    $L5)
    ($mC14   $C24    $L5)

    ($mC14   $mC24   $L6)// 132
    ( $C14   $mC24   $L6)
    ( $C14   $C24    $L6)
    ($mC14   $C24    $L6)

    ($mC14   $mC24   $L7)// 136
    ( $C14   $mC24   $L7)
    ( $C14   $C24    $L7)
    ($mC14   $C24    $L7)

);

blocks
(
     hex (4 5 6 7 0 1 2 3) ($NS1 $NS1 $NVert1) simpleGrading (1 1 1.0891080188015227)
     hex (8 9 10 11 4 5 6 7) ($NS1 $NS1 $NVert2) simpleGrading (1 1 1.910414324191631)
     hex (12 13 14 15 8 9 10 11) ($NS1 $NS1 $NVert3) simpleGrading (1 1 1.0)
     hex (16 17 18 19 12 13 14 15) ($NS1 $NS1 $NVert4) simpleGrading (1 1 1.2047651478636783)
     hex (20 21 22 23 16 17 18 19) ($NS1 $NS1 $NVert5) simpleGrading (1 1 0.9999999999965312)
     hex (24 25 26 27 20 21 22 23) ($NS1 $NS1 $NVert6) simpleGrading (1 1 0.5032895272011602)

     hex (4 32 33 5 0 28 29 1) ($NR1 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (5 33 34 6 1 29 30 2) ($NR1 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (6 34 35 7 2 30 31 3) ($NR1 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (7 35 32 4 3 31 28 0) ($NR1 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)

     hex (8 36 37 9 4 32 33 5) ($NR1 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (9 37 38 10 5 33 34 6) ($NR1 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (10 38 39 11 6 34 35 7) ($NR1 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (11 39 36 8 7 35 32 4) ($NR1 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)

     hex (12 40 41 13 8 36 37 9) ($NR1 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
     hex (13 41 42 14 9 37 38 10) ($NR1 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
     hex (14 42 43 15 10 38 39 11) ($NR1 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
     hex (15 43 40 12 11 39 36 8) ($NR1 $NS1  $NVert3) simpleGrading (1.0 1 1.0)

     hex (16 44 45 17 12 40 41 13) ($NR1 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (17 45 46 18 13 41 42 14) ($NR1 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (18 46 47 19 14 42 43 15) ($NR1 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (19 47 44 16 15 43 40 12) ($NR1 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)

     hex (20 48 49 21 16 44 45 17) ($NR1 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
     hex (21 49 50 22 17 45 46 18) ($NR1 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
     hex (22 50 51 23 18 46 47 19) ($NR1 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
     hex (23 51 48 20 19 47 44 16) ($NR1 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)

     hex (24 52 53 25 20 48 49 21) ($NR1 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (25 53 54 26 21 49 50 22) ($NR1 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (26 54 55 27 22 50 51 23) ($NR1 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (27 55 52 24 23 51 48 20) ($NR1 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)

     hex (32 60 61 33 28 56 57 29) ($NR2 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (33 61 62 34 29 57 58 30) ($NR2 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (34 62 63 35 30 58 59 31) ($NR2 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (35 63 60 32 31 59 56 28) ($NR2 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)

     hex (36 64 65 37 32 60 61 33) ($NR2 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (37 65 66 38 33 61 62 34) ($NR2 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (38 66 67 39 34 62 63 35) ($NR2 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (39 67 64 36 35 63 60 32) ($NR2 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)

//     hex (40 68 69 41 36 64 65 37) ($NR2 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
//     hex (41 69 70 42 37 65 66 38) ($NR2 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
//     hex (42 70 71 43 38 66 67 39) ($NR2 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
//     hex (43 71 68 40 39 67 64 36) ($NR2 $NS1  $NVert3) simpleGrading (1.0 1 1.0)

     hex (44 72 73 45 40 68 69 41) ($NR2 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (45 73 74 46 41 69 70 42) ($NR2 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (46 74 75 47 42 70 71 43) ($NR2 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (47 75 72 44 43 71 68 40) ($NR2 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)

//     hex (48 76 77 49 44 72 73 45) ($NR2 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
//     hex (49 77 78 50 45 73 74 46) ($NR2 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
//     hex (50 78 79 51 46 74 75 47) ($NR2 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
//     hex (51 79 76 48 47 75 72 44) ($NR2 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)

     hex (52 80 81 53 48 76 77 49) ($NR2 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (53 81 82 54 49 77 78 50) ($NR2 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (54 82 83 55 50 78 79 51) ($NR2 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (55 83 80 52 51 79 76 48) ($NR2 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)

     hex (60 88 89 61 56 84 85 57) ($NR3 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (61 89 90 62 57 85 86 58) ($NR3 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (62 90 91 63 58 86 87 59) ($NR3 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)
     hex (63 91 88 60 59 87 84 56) ($NR3 $NS1  $NVert1) simpleGrading (1.0 1 1.0891080188015227)

     hex (64 92 93 65 60 88 89 61) ($NR3 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (65 93 94 66 61 89 90 62) ($NR3 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (66 94 95 67 62 90 91 63) ($NR3 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)
     hex (67 95 92 64 63 91 88 60) ($NR3 $NS1  $NVert2) simpleGrading (1.0 1 1.910414324191631)

     hex (68 96 97 69 64 92 93 65) ($NR3 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
     hex (69 97 98 70 65 93 94 66) ($NR3 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
     hex (70 98 99 71 66 94 95 67) ($NR3 $NS1  $NVert3) simpleGrading (1.0 1 1.0)
     hex (71 99 96 68 67 95 92 64) ($NR3 $NS1  $NVert3) simpleGrading (1.0 1 1.0)

     hex (72 100 101 73 68 96 97 69) ($NR3 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (73 101 102 74 69 97 98 70) ($NR3 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (74 102 103 75 70 98 99 71) ($NR3 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)
     hex (75 103 100 72 71 99 96 68) ($NR3 $NS1  $NVert4) simpleGrading (1.0 1 1.2047651478636783)

     hex (76 104 105 77 72 100 101 73) ($NR3 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
     hex (77 105 106 78 73 101 102 74) ($NR3 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
     hex (78 106 107 79 74 102 103 75) ($NR3 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)
     hex (79 107 104 76 75 103 100 72) ($NR3 $NS1  $NVert5) simpleGrading (1.0 1 0.9999999999965312)

     hex (80 108 109 81 76 104 105 77) ($NR3 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (81 109 110 82 77 105 106 78) ($NR3 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (82 110 111 83 78 106 107 79) ($NR3 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)
     hex (83 111 108 80 79 107 104 76) ($NR3 $NS1  $NVert6) simpleGrading (1.0 1 0.5032895272011602)

     hex (88 116 117 89 84 112 113 85) ($NR4 $NS1  $NVert1) simpleGrading (1.88649957497573 1 1.0891080188015227)
     hex (89 117 118 90 85 113 114 86) ($NR4 $NS1  $NVert1) simpleGrading (1.88649957497573 1 1.0891080188015227)
     hex (90 118 119 91 86 114 115 87) ($NR4 $NS1  $NVert1) simpleGrading (1.88649957497573 1 1.0891080188015227)
     hex (91 119 116 88 87 115 112 84) ($NR4 $NS1  $NVert1) simpleGrading (1.88649957497573 1 1.0891080188015227)

     hex (92 120 121 93 88 116 117 89) ($NR4 $NS1  $NVert2) simpleGrading (1.88649957497573 1 1.910414324191631)
     hex (93 121 122 94 89 117 118 90) ($NR4 $NS1  $NVert2) simpleGrading (1.88649957497573 1 1.910414324191631)
     hex (94 122 123 95 90 118 119 91) ($NR4 $NS1  $NVert2) simpleGrading (1.88649957497573 1 1.910414324191631)
     hex (95 123 120 92 91 119 116 88) ($NR4 $NS1  $NVert2) simpleGrading (1.88649957497573 1 1.910414324191631)

     hex (96 124 125 97 92 120 121 93) ($NR4 $NS1  $NVert3) simpleGrading (1.88649957497573 1 1.0)
     hex (97 125 126 98 93 121 122 94) ($NR4 $NS1  $NVert3) simpleGrading (1.88649957497573 1 1.0)
     hex (98 126 127 99 94 122 123 95) ($NR4 $NS1  $NVert3) simpleGrading (1.88649957497573 1 1.0)
     hex (99 127 124 96 95 123 120 92) ($NR4 $NS1  $NVert3) simpleGrading (1.88649957497573 1 1.0)

     hex (100 128 129 101 96 124 125 97) ($NR4 $NS1  $NVert4) simpleGrading (1.88649957497573 1 1.2047651478636783)
     hex (101 129 130 102 97 125 126 98) ($NR4 $NS1  $NVert4) simpleGrading (1.88649957497573 1 1.2047651478636783)
     hex (102 130 131 103 98 126 127 99) ($NR4 $NS1  $NVert4) simpleGrading (1.88649957497573 1 1.2047651478636783)
     hex (103 131 128 100 99 127 124 96) ($NR4 $NS1  $NVert4) simpleGrading (1.88649957497573 1 1.2047651478636783)

     hex (104 132 133 105 100 128 129 101) ($NR4 $NS1  $NVert5) simpleGrading (1.88649957497573 1 0.9999999999965312)
     hex (105 133 134 106 101 129 130 102) ($NR4 $NS1  $NVert5) simpleGrading (1.88649957497573 1 0.9999999999965312)
     hex (106 134 135 107 102 130 131 103) ($NR4 $NS1  $NVert5) simpleGrading (1.88649957497573 1 0.9999999999965312)
     hex (107 135 132 104 103 131 128 100) ($NR4 $NS1  $NVert5) simpleGrading (1.88649957497573 1 0.9999999999965312)

     hex (108 136 137 109 104 132 133 105) ($NR4 $NS1  $NVert6) simpleGrading (1.88649957497573 1 0.5032895272011602)
     hex (109 137 138 110 105 133 134 106) ($NR4 $NS1  $NVert6) simpleGrading (1.88649957497573 1 0.5032895272011602)
     hex (110 138 139 111 106 134 135 107) ($NR4 $NS1  $NVert6) simpleGrading (1.88649957497573 1 0.5032895272011602)
     hex (111 139 136 108 107 135 132 104) ($NR4 $NS1  $NVert6) simpleGrading (1.88649957497573 1 0.5032895272011602)

);

edges
(
    arc 28 29 (0    $mR1 $L1)
    arc 29 30 ($R1 0 $L1)
    arc 30 31 (0 $R1 $L1)
    arc 31 28 ($mR1 0 $L1)

    arc 32 33 (0    $mR1 $L2)
    arc 33 34 ($R1 0 $L2)
    arc 34 35 (0 $R1 $L2)
    arc 35 32 ($mR1 0 $L2)

    arc 36 37 (0    $mR1 $L3)
    arc 37 38 ($R1 0 $L3)
    arc 38 39 (0 $R1 $L3)
    arc 39 36 ($mR1 0 $L3)

    arc 40 41 (0    $mR1 $L4)
    arc 41 42 ($R1 0 $L4)
    arc 42 43 (0 $R1 $L4)
    arc 43 40 ($mR1 0 $L4)

    arc 44 45 (0    $mR1 $L5)
    arc 45 46 ($R1 0 $L5)
    arc 46 47 (0 $R1 $L5)
    arc 47 44 ($mR1 0 $L5)

    arc 48 49 (0    $mR1 $L6)
    arc 49 50 ($R1 0 $L6)
    arc 50 51 (0 $R1 $L6)
    arc 51 48 ($mR1 0 $L6)

    arc 52 53 (0    $mR1 $L7)
    arc 53 54 ($R1 0 $L7)
    arc 54 55 (0 $R1 $L7)
    arc 55 52 ($mR1 0 $L7)

    arc 56 57 (0    $mR2 $L1)
    arc 57 58 ($R2 0 $L1)
    arc 58 59 (0 $R2 $L1)
    arc 59 56 ($mR2 0 $L1)

    arc 60 61 (0    $mR2 $L2)
    arc 61 62 ($R2 0 $L2)
    arc 62 63 (0 $R2 $L2)
    arc 63 60 ($mR2 0 $L2)

    arc 64 65 (0    $mR2 $L3)
    arc 65 66 ($R2 0 $L3)
    arc 66 67 (0 $R2 $L3)
    arc 67 64 ($mR2 0 $L3)

    arc 68 69 (0    $mR2 $L4)
    arc 69 70 ($R2 0 $L4)
    arc 70 71 (0 $R2 $L4)
    arc 71 68 ($mR2 0 $L4)

    arc 72 73 (0    $mR2 $L5)
    arc 73 74 ($R2 0 $L5)
    arc 74 75 (0 $R2 $L5)
    arc 75 72 ($mR2 0 $L5)

    arc 76 77 (0    $mR2 $L6)
    arc 77 78 ($R2 0 $L6)
    arc 78 79 (0 $R2 $L6)
    arc 79 76 ($mR2 0 $L6)

    arc 80 81 (0    $mR2 $L7)
    arc 81 82 ($R2 0 $L7)
    arc 82 83 (0 $R2 $L7)
    arc 83 80 ($mR2 0 $L7)

    arc 84 85 (0    $mR3 $L1)
    arc 85 86 ($R3 0 $L1)
    arc 86 87 (0 $R3 $L1)
    arc 87 84 ($mR3 0 $L1)

    arc 88 89 (0    $mR3 $L2)
    arc 89 90 ($R3 0 $L2)
    arc 90 91 (0 $R3 $L2)
    arc 91 88 ($mR3 0 $L2)

    arc 92 93 (0    $mR3 $L3)
    arc 93 94 ($R3 0 $L3)
    arc 94 95 (0 $R3 $L3)
    arc 95 92 ($mR3 0 $L3)

    arc 96 97 (0    $mR3 $L4)
    arc 97 98 ($R3 0 $L4)
    arc 98 99 (0 $R3 $L4)
    arc 99 96 ($mR3 0 $L4)

    arc 100 101 (0    $mR3 $L5)
    arc 101 102 ($R3 0 $L5)
    arc 102 103 (0 $R3 $L5)
    arc 103 100 ($mR3 0 $L5)

    arc 104 105 (0    $mR3 $L6)
    arc 105 106 ($R3 0 $L6)
    arc 106 107 (0 $R3 $L6)
    arc 107 104 ($mR3 0 $L6)

    arc 108 109 (0    $mR3 $L7)
    arc 109 110 ($R3 0 $L7)
    arc 110 111 (0 $R3 $L7)
    arc 111 108 ($mR3 0 $L7)

    arc 112 113 (0    $mR4 $L1)
    arc 113 114 ($R4 0 $L1)
    arc 114 115 (0 $R4 $L1)
    arc 115 112 ($mR4 0 $L1)

    arc 116 117 (0    $mR4 $L2)
    arc 117 118 ($R4 0 $L2)
    arc 118 119 (0 $R4 $L2)
    arc 119 116 ($mR4 0 $L2)

    arc 120 121 (0    $mR4 $L3)
    arc 121 122 ($R4 0 $L3)
    arc 122 123 (0 $R4 $L3)
    arc 123 120 ($mR4 0 $L3)

    arc 124 125 (0    $mR4 $L4)
    arc 125 126 ($R4 0 $L4)
    arc 126 127 (0 $R4 $L4)
    arc 127 124 ($mR4 0 $L4)

    arc 128 129 (0    $mR4 $L5)
    arc 129 130 ($R4 0 $L5)
    arc 130 131 (0 $R4 $L5)
    arc 131 128 ($mR4 0 $L5)

    arc 132 133 (0    $mR4 $L6)
    arc 133 134 ($R4 0 $L6)
    arc 134 135 (0 $R4 $L6)
    arc 135 132 ($mR4 0 $L6)

    arc 136 137 (0    $mR4 $L7)
    arc 137 138 ($R4 0 $L7)
    arc 138 139 (0 $R4 $L7)
    arc 139 136 ($mR4 0 $L7)

);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            ( 0 1 2 3)

            ( 0 28 29 1)
            ( 1 29 2 30)
            ( 2 30 31 3)
            ( 3 31 28 0)

            ( 28 56 57 29)
            ( 29 57 30 58)
            ( 30 58 59 31)
            ( 31 59 56 28)

            ( 56 84 85 57)
            ( 57 85 58 86)
            ( 58 86 87 59)
            ( 59 87 84 56)

            ( 84 112 113 85)
            ( 85 113 86 114)
            ( 86 114 115 87)
            ( 87 115 112 84)

        );
    }
    inlet_sparger_top
    {
        type patch;
        faces
        (
            ( 36 64 65 37)
            ( 37 65 38 66)
            ( 38 66 67 39)
            ( 39 67 64 36)

        );
    }
    inlet_sparger_bottom
    {
        type patch;
        faces
        (
            ( 44 72 73 45)
            ( 45 73 46 74)
            ( 46 74 75 47)
            ( 47 75 72 44)

        );
    }
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
defaultPatch
{type wall;}

